src/cf/Reports/CRM_ИзменениеABCXYZРаспределенияКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Report>
		<Properties>
			<Name>CRM_ИзменениеABCXYZРаспределенияКлиентов</Name>
			<Comment>Не переносить в объединенные решения</Comment>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/Enums/ABCКлассификация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>ABCКлассификация</Name>
			<Comment>Не переносить в объединенные решения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>BКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКлассифицирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/XYZКлассификация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>XYZКлассификация</Name>
			<Comment>Не переносить в объединенные решения</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>XКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ZКласс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеКлассифицирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Reports/CRM_ИзменениеABCXYZРаспределенияКлиентов/Ext/ManagerModule.bsl
// Возвращает текстовое описание класса по его значению.
// Параметры:
// ЗначениеКласса - значение класса, для которого нужно определить описание.
//
Функция ПолучитьОписаниеКласса(ЗначениеКласса)

	Если ЗначениеКласса = Перечисления.ABCКлассификация.ПустаяСсылка() Тогда
		Возврат НСтр("ru='потенциальный клиент(ABC)'");
	ИначеЕсли ЗначениеКласса = Перечисления.ABCКлассификация.НеКлассифицирован Тогда
		Возврат НСтр("ru='потерянный клиент(ABC)'");
	ИначеЕсли ЗначениеКласса = Перечисления.XYZКлассификация.ПустаяСсылка() Тогда
		Возврат НСтр("ru='потенциальный клиент(XYZ)'");
	ИначеЕсли ЗначениеКласса = Перечисления.XYZКлассификация.НеКлассифицирован Тогда
		Возврат НСтр("ru='потерянный клиент(XYZ)'");
	Иначе
		Возврат Строка(ЗначениеКласса);
	КонецЕсли;

КонецФункции

// Возвращает текстовое описание классификации по значениям ABC/XYZ классов.
// Параметры:
// ABC - значение ABC классификации,
// XYZ - значение XYZ классификации,
//
Функция ПолучитьПредставлениеКлассификации(ABC, XYZ) Экспорт

	ПредставлениеABC = ПолучитьОписаниеКласса(ABC);
	ПредставлениеXYZ = ПолучитьОписаниеКласса(XYZ);
	Возврат ПредставлениеABC + ", " + ПредставлениеXYZ;

КонецФункции

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВариантыОтчетов

// Настройки вариантов этого отчета.
// Подробнее - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
Процедура НастроитьВариантыОтчета(Настройки, ОписаниеОтчета) Экспорт
	
	// Настройка размещения, видимости по умолчанию, важности.
	ОписаниеВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, ОписаниеОтчета, "Основной");
	ОписаниеВарианта.ВидимостьПоУмолчанию = Ложь;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецЕсли
